https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.iloc.html

In [1]:
import pandas as pd

In [2]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
          {'a': 100, 'b': 200, 'c': 300, 'd': 400},
          {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]
df = pd.DataFrame(mydict)

In [3]:
df.head()

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [4]:
type(df.iloc[0])

pandas.core.series.Series

With a list of integers.

In [5]:
df.iloc[[0]]

   a  b  c  d
0  1  2  3  4

In [6]:
df.iloc[[0,1]]

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

With a slice object.

In [7]:
df.iloc[:3]

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [8]:
df.iloc[[0, 2]]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [9]:
df.iloc[[0, 2], [1, 3]]

      b     d
0     2     4
2  2000  4000

In [10]:
df.iloc[:2,:]

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

In [11]:
df.head()

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [12]:
import numpy as np

In [13]:
data = {'c1': [1,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],
        'c2': [1,2,3,np.nan,5,np.nan,6,np.nan,np.nan,8,9,10,np.nan]}
df = pd.DataFrame(data)

In [14]:
df.head()

    c1   c2
0  1.0  1.0
1  2.0  2.0
2  3.0  3.0
3  4.0  NaN
4  5.0  5.0

Check column has null values

In [15]:
df.isnull().sum()

c1    3
c2    5
dtype: int64

Check column has null values any

In [16]:
df.isnull().values.any()

True

In [17]:
import numpy as np
import pandas as pd
data = {'cardinal' : ['1st', '2nd', '3rd', '4th', '5th', '6th', '7th', '8th', '9th', '10th',
 '11th', '12th', '13th', '14th', '15th', '16th', '17th', '18th', '19th',
 '20th', '21st', '22nd', '23rd', '24th', '25th', '26th', '27th', '28th',
 '29th', '30th', '31st'],
        }
df = pd.DataFrame(data)

In [18]:
df['ordinal'] = df['cardinal'].apply(lambda y: int(y.replace('th','')) if str(y).__contains__('th') == True else 0)
# have to correct 1st, 2nd and 3rd

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   cardinal  31 non-null     object
 1   ordinal   31 non-null     int64
dtypes: int64(1), object(1)
memory usage: 624.0+ bytes

In [20]:
df.head()

  cardinal  ordinal
0      1st        0
1      2nd        0
2      3rd        0
3      4th        4
4      5th        5

In [21]:
df['ordinal'] = df['cardinal']
df['ordinal'] = df['ordinal'].apply(lambda y: int(y.replace('th','')) if str(y).__contains__('th') == True else y)
df['ordinal'] = df['ordinal'].apply(lambda y: int(y.replace('st','')) if str(y).__contains__('st') == True else y)
df['ordinal'] = df['ordinal'].apply(lambda y: int(y.replace('nd','')) if str(y).__contains__('nd') == True else y)
df['ordinal'] = df['ordinal'].apply(lambda y: int(y.replace('rd','')) if str(y).__contains__('rd') == True else y)

In [22]:
df.head()

  cardinal  ordinal
0      1st        1
1      2nd        2
2      3rd        3
3      4th        4
4      5th        5

![pandas.DataFrame.describe|https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.describe.html]

In [23]:
s = pd.Series([1,   1,	1,	1,	1,	9,	9,	9,	9,	1000000,1000000,1000000,1000000,])
s.describe()

count         13.000000
mean      307695.461538
std       480382.273009
min            1.000000
25%            1.000000
50%            9.000000
75%      1000000.000000
max      1000000.000000
dtype: float64

In [24]:
s2 = pd.Series([100000,	10,	10,	10,	9,	9,	9,	9,	111,	111,	1,	1,	1,])
s2.describe()

count        13.000000
mean       7714.692308
std       27728.311439
min           1.000000
25%           9.000000
50%           9.000000
75%          10.000000
max      100000.000000
dtype: float64

In [25]:
s = pd.DataFrame(
    {
    "x":[1,2,3,4],
    "y":['a', 'a', 'b', 'c'],
    }
)
s.describe()

              x
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

In [26]:
s.describe(include='all')

               x    y
count   4.000000    4
unique       NaN    3
top          NaN    a
freq         NaN    2
mean    2.500000  NaN
std     1.290994  NaN
min     1.000000  NaN
25%     1.750000  NaN
50%     2.500000  NaN
75%     3.250000  NaN
max     4.000000  NaN

In [27]:
s.y.describe()

count     4
unique    3
top       a
freq      2
Name: y, dtype: object